{
  "nodes": [
    {
      "op": "null", 
      "name": "/conv2d_9_input1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(0, 28, 28, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "transpose", 
      "name": "transpose67", 
      "attrs": {"axes": "[0, 3, 1, 2]"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_9/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(3, 3, 1, 32)"
      }, 
      "inputs": []
    }, 
    {
      "op": "transpose", 
      "name": "transpose68", 
      "attrs": {"axes": "(3, 2, 0, 1)"}, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_9/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[1, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose69", 
      "attrs": {"axes": "[0, 2, 3, 1]"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_9/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(32,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add33", 
      "inputs": [[5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu25", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose73", 
      "attrs": {"axes": "[0, 3, 1, 2]"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_10/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(3, 3, 32, 64)"
      }, 
      "inputs": []
    }, 
    {
      "op": "transpose", 
      "name": "transpose74", 
      "attrs": {"axes": "(3, 2, 0, 1)"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_10/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose75", 
      "attrs": {"axes": "[0, 2, 3, 1]"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_10/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add35", 
      "inputs": [[13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu27", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose78", 
      "attrs": {"axes": "[0, 3, 1, 2]"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "max_pooling2d_5/pool2d2", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose79", 
      "attrs": {"axes": "[0, 2, 3, 1]"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout_9/dropout2", 
      "attrs": {"p": "0.25"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten9", 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_9/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(9216, 128)"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot17", 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_9/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(128,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add37", 
      "inputs": [[23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu29", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout_10/dropout2", 
      "attrs": {"p": "0.5"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_10/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(128, 10)"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot19", 
      "inputs": [[27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_10/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(10,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add39", 
      "inputs": [[29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax9", 
      "inputs": [[31, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 2, 6, 10, 14, 22, 24, 28, 30], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35
  ], 
  "heads": [[32, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10300]}
}